



Network Working Group                                     S. Randriamasy
Internet-Draft                                           Nokia Bell Labs
Intended status: Standards Track                                 R. Yang
Expires: August 11, 2019                                 Yale University
                                                                   Q. Wu
                                                                  Huawei
                                                                 L. Deng
                                                            China Mobile
                                                               N. Schwan
                                                      Thales Deutschland
                                                        February 7, 2019


                           ALTO Cost Calendar
                    draft-ietf-alto-cost-calendar-10

Abstract

   This document is an extension to the base Application-Layer Traffic
   Optimization (ALTO) protocol.  It extends the ALTO cost information
   service such that applications decide not only 'where' to connect,
   but also 'when'.  This is useful for applications that need to
   perform bulk data transfer and would like to schedule these transfers
   during an off-peak hour, for example.  This extension introduces ALTO
   Cost Calendars, with which an ALTO Server exposes ALTO cost values in
   JSON arrays where each value corresponds to a given time interval.
   The time intervals as well as other Calendar attributes are specified
   in the Information Resources Directory and ALTO Server responses.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in
   BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

   When the words appear in lower case, they are to be interpreted with
   their natural language meanings.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute




Randriamasy, et al.      Expires August 11, 2019                [Page 1]

Internet-Draft             ALTO Cost Calendar              February 2019


   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on August 11, 2019.

Copyright Notice

   Copyright (c) 2019 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Overview of ALTO Cost Calendars . . . . . . . . . . . . . . .   4
     2.1.  ALTO Cost Calendar information features . . . . . . . . .   5
     2.2.  ALTO Calendar design characteristics  . . . . . . . . . .   6
       2.2.1.  ALTO Cost Calendar for all cost modes . . . . . . . .   7
       2.2.2.  Compatibility with legacy ALTO Clients  . . . . . . .   7
   3.  ALTO Calendar specification: IRD extensions . . . . . . . . .   8
     3.1.  Calendar attributes in the IRD resources capabilities . .   8
     3.2.  Calendars in a delegate IRD . . . . . . . . . . . . . . .   9
     3.3.  Example IRD with ALTO Cost Calendars  . . . . . . . . . .  10
   4.  ALTO Calendar specification: Service Information Resources  .  13
     4.1.  Calendar extensions for Filtered Cost Maps (FCM)  . . . .  14
       4.1.1.  Calendar extensions in Filtered Cost Map requests . .  14
       4.1.2.  Calendar extensions in Filtered Cost Map responses  .  15
       4.1.3.  Use case and example: FCM with a bandwidth Calendar .  17
     4.2.  Calendar extensions in the Endpoint Cost Service  . . . .  20
       4.2.1.  Calendar specific input in  Endpoint Cost requests  .  20
       4.2.2.  Calendar attributes in the Endpoint Cost response . .  20
       4.2.3.  Use case and example: ECS with a routingcost Calendar  21
       4.2.4.  Use case and example: ECS with a multi-cost calendar
               for routingcost and owdelay . . . . . . . . . . . . .  24



Randriamasy, et al.      Expires August 11, 2019                [Page 2]

Internet-Draft             ALTO Cost Calendar              February 2019


   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  26
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .  26
   7.  Operational Considerations  . . . . . . . . . . . . . . . . .  27
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  28
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  28
     9.1.  Normative References  . . . . . . . . . . . . . . . . . .  28
     9.2.  Informative References  . . . . . . . . . . . . . . . . .  28
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  29

1.  Introduction

   The base Application-Layer Traffic Optimization (ALTO) protocol
   specified in [RFC7285] provides guidance to overlay applications
   needing to select one or several hosts from a set of candidates able
   to provide a desired resource.  This guidance is based on parameters
   that affect performance and efficiency of the data transmission
   between the hosts such as the topological distance.  The goal of ALTO
   is to improve the Quality of Experience (QoE) in the application
   while optimizing resource usage in the underlying network
   infrastructure.

   The ALTO protocol in [RFC7285] specifies a network map which defines
   groupings of endpoints in provider-defined network regions identified
   by Provider-defined Identifiers (PIDs).  The Cost Map Service,
   Endpoint Cost Service (ECS) and Endpoint Ranking Service then provide
   ISP-defined costs and rankings for connections among the specified
   endpoints and PIDs and thus incentives for application clients to
   connect to ISP preferred locations, e.g. to reduce their costs.  ALTO
   intentionally avoids provisioning realtime information as explained
   in the ALTO Problem Statement [RFC5693] and ALTO Requirements
   [RFC5693].  Thus the current Cost Map and Endpoint Cost Service are
   providing, for a given Cost Type, exactly one path cost value.
   Applications have to query one of these two services to retrieve the
   currently valid cost values.  They therefore need to plan their ALTO
   information requests according to their own estimation of the
   frequency of cost value change.

   With [RFC7285], an ALTO client should interpret the returned costs as
   those at the query moment.  However, Network costs can fluctuate,
   e.g. due to diurnal patterns of traffic demand or planned events such
   as network maintenance, holidays or highly publicized events.
   Providing network costs for only the current time thus may not be
   sufficient, in particular for applications that can schedule their
   traffic in a span of time, for example by deferring backups or other
   background traffic to off-peak hours.

   In case the ALTO Cost value changes are predictable over a certain
   period of time and the application does not require immediate data



Randriamasy, et al.      Expires August 11, 2019                [Page 3]

Internet-Draft             ALTO Cost Calendar              February 2019


   transfer, it can save time to get the whole set of cost values over
   this period in one single ALTO response.  Using this set to schedule
   data transfers allows optimizing the network resources usage and QoE.
   ALTO Clients and Servers can also minimize their workload by reducing
   and accordingly scheduling their data exchanges.

   This document extends [RFC7285] to allow an ALTO server to provide
   network costs for a given duration of time.  A sequence of network
   costs across a time span for a given pair of network locations is
   named an "ALTO Cost Calendar".  The Filtered Cost Map Service and
   Endpoint Cost Service are extended to provide Cost Calendars.  In
   addition to this functional ALTO enhancement, we expect to further
   save network and storage resources by gathering multiple Cost Values
   for one Cost Type into one single ALTO Server response.

   In this draft an "ALTO Cost Calendar" is specified in terms of
   information resources capabilities that are applicable to time-
   sensitive ALTO metrics.  An ALTO Cost Calendar exposes ALTO Cost
   Values in JSON arrays, see [RFC8259], where each value corresponds to
   a given time interval.  The time intervals as well as other Calendar
   attributes are specified in the Information Resources Directory (IRD)
   and in the Server response to allow the ALTO Client to interpret the
   received ALTO values.  Last, the extensions for ALTO Calendars are
   applicable to any Cost Mode and they ensure backwards compatibility
   with legacy ALTO clients.

   In the rest of this document, Section 2 provides the design
   characteristics.  Sections 3 and 4 define the formal specifications
   for the IRD and the information resources.  IANA, security and
   operational considerations are addressed respectively in sections
   Section 5, Section 6 and Section 7.

2.  Overview of ALTO Cost Calendars

   An ALTO Cost calendar provided by the ALTO Server provides 2
   information items:

   o  an array of values for a given metric, where each value
      corresponds to a time interval, where the value array can
      sometimes be a cyclic pattern that repeats a certain number of
      times.

   o  attributes describing the time scope of the calendar such as the
      size and number of the intervals and the date of the starting
      point of the calendar, allowing an ALTO Client to properly
      interpret the values.





Randriamasy, et al.      Expires August 11, 2019                [Page 4]

Internet-Draft             ALTO Cost Calendar              February 2019


   An ALTO Cost Calendar can be used like a "time table" to figure out
   the best time to schedule data transfers and also to proactively
   manage application traffic given predictable events such as crowded
   events, traffic intensive holidays and network maintenance.  It may
   be viewed as a synthetic abstraction of, for example, real
   measurements gathered over previous periods on which statistics have
   been computed.  However, like for any schedule, unexpected network
   incidents may require the current ALTO Calendar to be updated and re-
   sent to the ALTO Clients needing it.  To this end, it is RECOMMENDED
   that ALTO Servers providing ALTO Calendars also provide the "ALTO
   Incremental Updates Using Server-Sent Events (SSE)" Service that is
   specified in [draft-ietf-alto-incr-update-sse], and likewise, that
   ALTO Clients capable of using ALTO Calendars also use the SSE
   Service.

   Most likely, the ALTO Cost Calendar would be used for the Endpoint
   Cost Service, assuming that a limited set of feasible Endpoints for a
   non-real time application is already identified, that they do not
   need to be accessed immediately and that their access can be
   scheduled within a given time period.  The Filtered Cost Map Service
   is also applicable as long as the size of the Map allows it.

2.1.  ALTO Cost Calendar information features

   The Calendar attributes are provided in the Information Resources
   Directory (IRD) and in ALTO Server responses.  The IRD announces
   attributes with dateless values in its information resources
   capabilities, where as attributes with time dependent values are
   provided in the "meta" of Server responses.  The ALTO Cost Calendar
   attributes provide the following information:

   o  attributes to describe the time scope of the Calendar value array:

      *  generic time zone,

      *  applicable time interval size for each calendar value, defined
         in seconds, that can cover a wide range of values.

      *  duration of the Calendar: e.g. the number of intervals provided
         in the calendar.

   o  "calendar-start-date": specifying when the calendar starts, that
      is to which date the first value of the cost calendar is
      applicable.

   o  "repeated": an optional attribute indicating for how many
      iterations the provided calendar will have the same values.  The
      server may use it to allow the client to schedule its next request



Randriamasy, et al.      Expires August 11, 2019                [Page 5]

Internet-Draft             ALTO Cost Calendar              February 2019


      and thus save its own workload by avoiding to process useless
      requests.

   Attribute "repeated" may take a very high value if a Calendar
   represents a cyclic value pattern that the Server considers valid for
   a long period and hence will only update once this period has elapsed
   or if an unexpected event occurs on the network, see in next
   sections.

2.2.  ALTO Calendar design characteristics

   The extensions in this document and encode requests and responses
   using JSON [RFC8259].

   Formally, the cost entries in an ALTO cost map can be any type of
   JSON value [RFC8259], (see the DstCosts object in Section 11.2.3.6 of
   [RFC7285]).  However, that section also says that an implementation
   of [RFC7285] SHOULD assume that the cost is a JSON number and fail to
   parse if it is not, unless the implementation is using an extension
   that signals a different data type.  This document extends the
   definition of a legacy cost map given in [RFC7285] to allow a cost
   entry to be an array of values, one per time interval, instead of
   just one number.

   To realize an ALTO Calendar, this document extends: the IRD, the ALTO
   requests and responses for Cost Calendars.

   This extension is designed to be light and ensure backwards
   compatibility with base protocol ALTO Clients and with other
   extensions.  As recommended, it relies on section 8.3.7 "Parsing of
   Unknown Fields" of [RFC7285] that writes: "Extensions may include
   additional fields within JSON objects defined in this document.  ALTO
   implementations MUST ignore unknown fields when processing ALTO
   messages."

   The calendar-specific capabilities are integrated in the information
   resources of the IRD and in the "meta" member of ALTO responses to
   Cost Calendars requests.  A calendar and its capabilities are
   associated with a given information resource and within this
   information resource with a given cost type.  This design has several
   advantages:

   o  it does not introduce a new mode,

   o  it does not introduce new media types,

   o  it allows an ALTO Server to offer calendar capabilities on a cost
      type, with attributes values adapted to each information resource.



Randriamasy, et al.      Expires August 11, 2019                [Page 6]

Internet-Draft             ALTO Cost Calendar              February 2019


   The applicable calendared information resources are:

   o  the Filtered Cost Map,

   o  the Endpoint Cost Map.

   The ALTO Server can choose in which frequency it provides cost
   Calendars to ALTO Clients.  It may either provide calendar updates
   starting at the request date, or carefully schedule its updates so as
   to take profit from a potential repetition/periodicity of calendar
   values.

2.2.1.  ALTO Cost Calendar for all cost modes

   ALTO Calendars are well-suited for values encoded in the "numerical"
   mode.  Actually, Calendars can also represent metrics in other modes
   considered as compatible with time-varying values.  For example,
   types of Cost values such as JSONBool can also be expressed as
   calendars, as their value may be 'true' or 'false' depending on given
   time periods or likewise, values represented by strings, such as
   "medium", "high", "low", "blue", "open".

   Note also that a Calendar is suitable as well for time-varying
   metrics provided in the "ordinal" mode, if these values are time-
   varying and the ALTO Server provides updates of cost value based
   preferences.

2.2.2.  Compatibility with legacy ALTO Clients

   The ALTO protocol extensions for Cost Calendars have been defined so
   as to ensure that Calendar capable ALTO Servers can provide legacy
   ALTO Clients with legacy information resources as well.  That is a
   legacy ALTO Client can request resources and receive responses as
   specified in [RFC7285].

   A Calendar-aware ALTO Server MUST implement the base protocol
   specified in [RFC7285].

   As a consequence, when a metric is available as a Calendar array, it
   MUST be available as a single value, as provided by [RFC7285] as
   well.  The Server, in this case provides the current value of the
   metric to either Calendar-aware Clients not interested in future or
   time-based values, or Clients implementing [RFC7285] only.

   For compatibility with legacy ALTO Clients specified in [RFC7285],
   calendared information resources are not applicable for full cost
   maps for the following reason: a legacy ALTO client would receive a
   calendared cost map via an HTTP 'GET' command.  As specified in



Randriamasy, et al.      Expires August 11, 2019                [Page 7]

Internet-Draft             ALTO Cost Calendar              February 2019


   section 8.3.7 of [RFC7285], it will ignore the Calendar Attributes
   indicated in the "meta" of the responses.  Therefore, lacking
   information on calendar attributes, it will not be able to correctly
   interpret and process the values of the received array of calendar
   cost values.

   Therefore, calendared information resources MUST be requested via the
   Filtered Cost Map Service or the Endpoint Cost Service, using a POST
   method.

3.  ALTO Calendar specification: IRD extensions

   The Calendar attributes in the IRD information resources capabilities
   carry constant dateless values.  A calendar is associated with an
   information resource rather than a cost type.  For example, a Server
   can provide a "routingcost" calendar for the Filtered Cost Map
   Service at a granularity of one day and a "routingcost" calendar for
   the Endpoint Cost Service at a finer granularity but for a limited
   number of endpoints.  An example IRD with Calendar specific features
   is provided in Section 3.3.

3.1.  Calendar attributes in the IRD resources capabilities

   When for an applicable resource, an ALTO Server provides a Cost
   Calendar for a given Cost Type, it MUST indicate this in the IRD
   capabilities of this resource, by an object of type
   CalendarAttributes, that associates one or more Cost Types with these
   Calendar Attributes and is specified below.

   The capabilities of a Calendar-aware information resource entry have
   a member named "calendar-attributes" which is an array of objects of
   type CalendarAttributes.  Each CalendarAttributes object applies to a
   set of one or more Cost Types.  Different Calendar Attributes may
   apply to different Cost Types supported by this resource.

   A Cost Type name MUST appear no more than once in the "calendar-
   attributes" member of a resource entry.  If, in a resource entry, a
   Cost Type name appears more than one time in a CalendarAttributes
   object of the "calendar-attributes" member, or in more than one
   CalendarAttributes object of the "calendar-attributes" member, the
   ALTO client MUST ignore any occurrence of this name beyond the first
   one encountered.

   It is RECOMMENDED for an ALTO Server that the time interval size
   specified in the IRD is the smallest possible one that it can
   provide.  The Client can aggregate cost values on its own if it needs
   a larger granularity.




Randriamasy, et al.      Expires August 11, 2019                [Page 8]

Internet-Draft             ALTO Cost Calendar              February 2019


   The encoding format for object CalendarAttributes, using JSON
   [RFC8259], is as follows:

   CalendarAttributes calendar-attributes <1..*>;

   object{
     JSONString cost-type-names <1..*>;
     JSONNumber time-interval-size;
     JSONNumber number-of-intervals;
   } CalendarAttributes;

   o  "cost-type-names":

      *  An array of one or more elements indicating the cost-type-names
         in the IRD entry to which the capabilities apply.

   o  "time-interval-size":

      *  is the duration of an ALTO calendar time interval in seconds.
         A "time-interval-size" value contains a JSONNumber.  ALTO
         servers SHOULD use at least IEEE 754 double-precision floating
         point [IEEE.754.2008] to store this value.  Example values are:
         300 , 7200, meaning that each calendar value applies on a time
         interval that lasts respectively 5 minutes and 2 hours.

   o  "number-of-intervals":

      *  the integer number of values of the cost calendar array, at
         least equal to 1.

   - Attribute "cost-type-names" provides a better readability to the
   calendar attributes specified in the IRD and avoids confusion with
   calendar attributes of other cost-types.

   - Multiplying 'time-interval-size' by 'number-of-intervals' provides
   the duration of the provided calendar.  For example an ALTO Server
   may provide a calendar for ALTO values changing every 'time-interval-
   size' equal to 5 minutes.  If 'number-of-intervals' has the value 12,
   then the duration of the provided calendar is "1 hour".

3.2.  Calendars in a delegate IRD

   One option to better sort out IRD resources w.r.t. for instance
   supported extended services, is that a "root" ALTO Server
   implementing base protocol resources delegates "specialized"
   information resources such as the ones providing Cost Calendars to
   another ALTO Server running in a subdomain specified with its URI in




Randriamasy, et al.      Expires August 11, 2019                [Page 9]

Internet-Draft             ALTO Cost Calendar              February 2019


   the "root" ALTO Server.  This option is described in Section 9.2.4
   "Delegation using IRDs" of [RFC7285].

   This document provides an example, where a "root" ALTO Server runs in
   a domain called "alto.example.com".  It delegates the announcement of
   Calendars capabilities to an ALTO Server running in a subdomain
   called "custom.alto.example.com".  The location of the "delegate
   Calendar IRD" is assumed to be indicated in the "root" IRD by the
   resource entry: "custom-calendared-resources".

   Another advantage is that some Cost Types for some resources may be
   more advantageous as Cost Calendars and it makes few sense to get
   them as a single value.  For example, Cost Types with predictable and
   frequently changing values, calendared in short time intervals such
   as a minute.

3.3.  Example IRD with ALTO Cost Calendars

   This section provides an example ALTO Server IRD that supports
   various cost metrics and cost modes.  In particular, since [RFC7285]
   makes it mandatory, the Server uses metric "routingcost" in the
   "numerical" mode.

   For illustrative purposes, this section introduces 3 other fictitious
   example metrics and modes that should be understood as examples and
   should not be used or considered as normative.

   The cost type names used in the example IRD as thus as follows:

   o  "num-routingcost": refers to metric "routingcost" in the numerical
      mode as defined in [RFC7285] and registered at the IANA.

   o  "num-owdelay": refers to some fictitious performance metric
      "owdelay" in the "numerical" mode,to reflect the one way packet
      transmission delay on a path.  A related performance metric is
      currently under definition in
      [draft-ietf-alto-performance-metrics].

   o  "num-throughputrating": refers to some fictitious metric
      "throughputrating" in the "numerical" mode, to reflect the
      provider preference in terms of end to end throughput.

   o  "string-servicestatus": refers to some fictitious metric
      "servicestatus" in some example mode "string", to reflect the
      availability, defined by the provider, of for instance path
      connectivity.

   The example IRD includes 2 particular URIs providing calendars:



Randriamasy, et al.      Expires August 11, 2019               [Page 10]

Internet-Draft             ALTO Cost Calendar              February 2019


   o  "https://custom.alto.example.com/calendar/costmap/filtered": a
      filtered cost map in which calendar capabilities are indicated for
      cost type names: "num-routingcost", "num-throughputrating" and
      "string-servicestatus",

   o  "https://custom.alto.example.com/calendar/endpointcost/lookup": an
      endpoint cost map in which calendar capabilities are indicated for
      cost type names: "num-routingcost", "num-owdelay", "num-
      throughputrating", "string-servicestatus".

   The design of the Calendar capabilities allows that some calendars on
   a cost type name are available in several information resources with
   different Calendar Attributes.  This is the case for calendars on
   "num-routingcost", "num-throughputrating" and "string-servicestatus",
   available in both the Filtered Cost map and Endpoint Cost Service,
   but with different time interval sizes for "num-throughputrating" and
   "string-servicestatus".

   GET /calendars-directory HTTP/1.1
   Host: custom.alto.example.com
   Accept: application/alto-directory+json,application/alto-error+json
   ---------------

   HTTP/1.1 200 OK
   Content-Length: 2626
   Content-Type: application/alto-directory+json

   {
     "meta" : {
       "default-alto-network-map" : "my-default-network-map",
       "cost-types": {
         "num-routingcost": {
           "cost-mode" : "numerical",
           "cost-metric" : "routingcost"
         },
         "num-owdelay": {
           "cost-mode"  : "numerical",
           "cost-metric": "owdelay"
         },
         "num-throughputrating": {
           "cost-mode"  : "numerical",
           "cost-metric": "throughputrating",
         },
         "string-servicestatus": {
           "cost-mode"  : "string",
           "cost-metric": "servicestatus",
         }
       }



Randriamasy, et al.      Expires August 11, 2019               [Page 11]

Internet-Draft             ALTO Cost Calendar              February 2019


     },
     "resources" : {
       "filtered-cost-map-calendar" : {
         "uri" :
           "https://custom.alto.example.com/calendar/costmap/filtered",
         "media-type" : "application/alto-costmap+json",
         "accepts" : "application/alto-costmapfilter+json",
         "capabilities" : {
           "cost-constraints" : true,
           "cost-type-names"  : [ "num-routingcost",
                                  "num-throughputrating",
                                  "string-servicestatus" ],
           "calendar-attributes" : [
             {"cost-type-names" : [ "num-routingcost",
                                    "num-throughputrating" ],
              "time-interval-size" : 7200,
              "number-of-intervals" : 24
             },
             {"cost-type-names" : [ "string-servicestatus" ],
              "time-interval-size" : 1800,
              "number-of-intervals" : 48
             }
           ]
         }
         "uses": [ "my-default-network-map" ]
       },
       "endpoint-cost-calendar-map" : {
         "uri" :
         "https://custom.alto.example.com/calendar/endpointcost/lookup",
         "media-type" : "application/alto-endpointcost+json",
         "accepts" : "application/alto-endpointcostparams+json",
         "capabilities" : {
           "cost-constraints" : true,
           "cost-type-names" : [ "num-routingcost",
                                 "num-owdelay",
                                 "num-throughputrating",
                                 "string-servicestatus" ],
           "calendar-attributes" : [
             {"cost-type-names" : [ "num-routingcost" ],
              "time-interval-size" : 3600,
              "number-of-intervals" : 24
             },
             {"cost-type-names" : [ "num-owdelay" ],
              "time-interval-size" : 300,
              "number-of-intervals" : 12
             },
             {"cost-type-names" : [ "num-throughputrating" ],
              "time-interval-size" : 60,



Randriamasy, et al.      Expires August 11, 2019               [Page 12]

Internet-Draft             ALTO Cost Calendar              February 2019


              "number-of-intervals" : 60
             },
             {"cost-type-names" : [ "string-servicestatus" ],
              "time-interval-size" : 120,
              "number-of-intervals" : 30
             }
           ]
         }
       }
     }
   }


   In this example IRD, for the Filtered Cost Map Service:

   o  the Calendar for "num-routingcost" and "num-throughputrating" is
      an array of 12 values each provided on a time interval lasting
      7200 seconds (2 hours).

   o  the Calendar for "string-servicestatus": "is an array of 48 values
      each provided on a time interval lasting 1800 seconds (30
      minutes).

   For the Endpoint Cost Service:

   o  the Calendar for "num-routingcost": is an array of 24 values each
      provided on a time interval lasting 3600 seconds (1 hour).

   o  the Calendar for "owdelay": is an array of 12 values each provided
      on a time interval lasting 300 seconds (5 minutes).

   o  the Calendar for "num-throughputrating": is an array of 60 values
      each provided on a time interval lasting 60 seconds (1 minute).

   o  the Calendar for "string-servicestatus": "is an array of 30 values
      each provided on a time interval lasting 120 seconds (2 minutes).

4.  ALTO Calendar specification: Service Information Resources

   This section documents the individual information resources defined
   to provide the calendared information services defined in this
   document.

   The reference time zone for the provided time values is UTC because
   the option chosen to express the time format is the HTTP header
   fields format specified in [RFC7231] where however timestamps are
   still displayed with the acronym GMT:




Randriamasy, et al.      Expires August 11, 2019               [Page 13]

Internet-Draft             ALTO Cost Calendar              February 2019


                    Date: Tue, 15 Nov 2014 08:12:31 GMT


   The value of a Calendar time interval size is expressed in seconds.

4.1.  Calendar extensions for Filtered Cost Maps (FCM)

   A legacy ALTO client requests and gets Filtered Cost Map responses as
   specified in [RFC7285].

4.1.1.  Calendar extensions in Filtered Cost Map requests

   The input parameters of a "legacy" request for a filtered cost map,
   defined by object ReqFilteredCostMap in section 11.3.2 of [RFC7285],
   are augmented with one additional member.

   A Calendar-aware ALTO client requesting a Calendar on a given Cost
   Type for a filtered cost map resource having Calendar capabilities
   MUST add the following field to its input parameters:

                          JSONBoolean calendared<1..*>;

   This field is an array of 1 to N boolean values, where N is the
   number of requested metrics.  Each entry corresponds to the requested
   metric at the same array position.  Each boolean value indicates
   whether or not the ALTO Server should provide the values for this
   Cost Type as a calendar.  The array MUST contain exactly N boolean
   values, otherwise the Server returns an error.

   This field MUST NOT be included if no member "calendar-attributes" is
   specified in this information resource.

   If a value of field 'calendared' is 'true' for a cost type name for
   which no calendar attributes have been specified: an ALTO Server,
   whether it implements the extensions of this document or only
   implements [RFC7285], MUST ignore it and return a response with a
   single cost value as specified in [RFC7285].

   If this field is not present, it MUST be assumed to have only values
   equal to 'false'.

   A Calendar-aware ALTO client that supports requests for only one cost
   type at a time and wants to request a Calendar MUST provide an array
   of 1 element:

                          "calendared" : [true];





Randriamasy, et al.      Expires August 11, 2019               [Page 14]

Internet-Draft             ALTO Cost Calendar              February 2019


   A Calendar-aware ALTO client that supports requests for more than one
   Cost Types at a time, as specified in [RFC8189] MUST provide an array
   of N values set to 'true' or 'false', depending whether it wants the
   applicable Cost Type values as a single or calendared value.

4.1.2.  Calendar extensions in Filtered Cost Map responses

   In a calendared ALTO Filtered Cost Map, a cost value between a source
   and a destination is a JSON array of JSON values.  An ALTO Calendar
   values array has a number of values equal to the value of member
   "number-of-intervals" of the Calendar attributes that are indicated
   in the IRD.  These attributes will be conveyed as metadata in the
   Filtered Cost Map response.  Each element of the array is valid for
   the time-interval that matches its array position.

   The FCM response conveys metadata among wich:

   o  some are not specific to Calendars and ensure compatibility with
      [RFC7285] and [RFC8189]

   o  some are specific to Calendars.

   The non Calendar specific "meta" fields of a calendared Filtered Cost
   Map response MUST include at least:

   o  if the ALTO Client requests cost values for one Cost Type at a
      time only: the "meta" fields specified in [RFC7285] for these
      information service responses:

      *  "dependent-vtags ",

      *  "cost-type" field.

   o  if the ALTO Client implements the Multi-Cost ALTO extension
      specified in [RFC8189] and requests cost values for several Cost
      Types at a time: the "meta" fields specified in [RFC8189] for
      these information service responses:

      *  "dependent-vtags ",

      *  "cost-type" field with value set to '{}', for backwards
         compatibility with [RFC7285].

      *  "multi-cost-types" field.

   If the client request does not provide member "calendared" or if it
   provides it with a value equal to 'false', for all the requested Cost




Randriamasy, et al.      Expires August 11, 2019               [Page 15]

Internet-Draft             ALTO Cost Calendar              February 2019


   Types, then the ALTO Server response is exactly as specified in
   [RFC7285] and [RFC8189].

   If the value of member "calendared" is equal to 'false' for a given
   requested Cost Type, the ALTO Server MUST return, for this Cost Type,
   a single cost value as specified in [RFC7285].

   If the value of member "calendared" is equal to 'true' for a given
   requested Cost Type, the ALTO Server returns, for this Cost Type, a
   cost value calendar as specified above in this section.  In addition
   to the above cited non Calendar specific "meta" members, the Server
   MUST provide a Calendar specific metadata field.

   The Calendar specific "meta" field that a calendared Filtered Cost
   Map response MUST include is a member called "calendar-response-
   attributes", that describes properties of the calendar and where:

   o  member "calendar-response-attributes" is an array of one or more
      objects of type "CalendarResponseAttributes".

   o  each "CalendarResponseAttributes" object in the array is specified
      for one or more Cost Types for which the value of member
      "calendared" is equal to 'true' and for which a Calendar is
      provided for the requested information resource.

   o  the "CalendarResponseAttributes" object that applies to a cost
      type name has a corresponding "CalendarAttributes" object defined
      for this cost type name in the IRD capabilities of the requested
      information resource.  The members of a
      "CalendarResponseAttributes" object include all the members of the
      corresponding "CalendarAttributes" object.

   The format of member "CalendarResponseAttributes is defined as
   follows:

   CalendarResponseAttributes calendar-response-attributes <1..*>;

   object{
     [JSONString cost-type-names <1..*>];
     JSONString calendar-start-time;
     JSONNumber time-interval-size;
     JSONNumber number-of-intervals;
     [JSONNumber repeated;]
   } CalendarResponseAttributes;

   Object CalendarResponseAttributes has the following attributes:





Randriamasy, et al.      Expires August 11, 2019               [Page 16]

Internet-Draft             ALTO Cost Calendar              February 2019


   o  "cost-type-names": is an array of one or more cost-type-names to
      which the capabilities apply and for which a Calendar has been
      requested.  The value of this member is a subset of the "cost-
      type-names" array specified in the corresponding IRD Calendar
      attributes.

   o  "calendar-start-time": indicates the date at which the first value
      of the calendar applies.  The value provided for the "calendar-
      start-time" attribute SHOULD NOT be later than the request date.

   o  "time-interval-size": as specified in Section 3.1 and with the
      same value.

   o  "number-of-intervals": as specified in Section 3.1 and with the
      same value.

   o  "repeated": is an optional field provided for Calendars.  It is an
      integer N greater or equal to '1' that indicates how many
      iterations of the calendar value array starting at the date
      indicated by "calendar-start-time" have the same values.  The
      number N includes the provided iteration.

   For example: suppose the "calendar-start-time" member has value "Mon,
   30 Jun 2014 at 00:00:00 GMT", the "time-interval-size" member has
   value '3600', the "number-of-intervals" member has value '24' and the
   value of member "repeated" is equal to '4'.  This means that the
   calendar values are the same on Monday, Tuesday, Wednesday and
   Thursday on a period of 24 hours starting at 00:00:00 GMT.  The ALTO
   Client thus may use the same calendar for the next 4 days starting at
   "calendar-start-time" and will only need to request a new one for
   Friday July 4th at 00:00:00 GMT.

   Attribute "repeated" may take a very high value if a Calendar
   represents a cyclic value pattern that the Server considers valid for
   a long period and hence will only update once this period has elapsed
   or if an unexpected event occurs on the network.  In the latter case,
   the client will be notified if it uses the "ALTO Incremental Updates
   Using Server-Sent Events (SSE)" Service, specified in
   [draft-ietf-alto-incr-update-sse].  See also discussion in Section 7
   "Operational Considerations".

4.1.3.  Use case and example: FCM with a bandwidth Calendar

   An example of non-real time information that can be provisioned in a
   'calendar' is the expected path throughput.  While the transmission
   rate can be measured in real time by end systems, the operator of a
   data center is in the position of formulating preferences for given
   paths, at given time periods for example to avoid traffic peaks due



Randriamasy, et al.      Expires August 11, 2019               [Page 17]

Internet-Draft             ALTO Cost Calendar              February 2019


   to diurnal usage patterns.  In this example, we assume that an ALTO
   Client requests a calendar of network provider defined throughput
   ratings, as specified in the IRD, to schedule its bulk data transfers
   as described in the use cases.

   In the example IRD, calendars for cost type name "num-
   throughputrating" are available for the information resources:
   "filtered-cost-calendar-map" and "endpoint-cost-calendar-map".  The
   ALTO Client requests a calendar for "num-throughputrating" via a POST
   request for a filtered cost map.

   We suppose in the present example that the ALTO Client sends its
   request on Tuesday July 1st 2014 at 13:15 and, to calculate the
   Content-Length in the server response, that the values for metric
   "throughputrating" are encoded in 2 digits.  The Server returns
   Calendars with arrays of 12 numbers for each source and destination
   pair.  To lighten the text, the arrays in the provided example are
   symbolized by expression "[v1,v2, ... v12]" that is otherwise not
   valid in JSON.  The same type of symbolization is used in the other
   example Server responses.































Randriamasy, et al.      Expires August 11, 2019               [Page 18]

Internet-Draft             ALTO Cost Calendar              February 2019


     POST /calendar/costmap/filtered HTTP/1.1
     Host: alto.example.com
     Content-Length: 218
     Content-Type: application/alto-costmapfilter+json
     Accept: application/alto-costmap+json,application/alto-error+json

     {
       "cost-type" : {"cost-mode" : "numerical",
                      "cost-metric" : "throughputrating"},
       "calendared" : [true],
       "pids" : {
         "srcs" : [ "PID1", "PID2" ],
         "dsts" : [ "PID1", "PID2", "PID3" ]
       }
     }


     HTTP/1.1 200 OK
     Content-Length: 902
     Content-Type: application/alto-costmap+json

     {
       "meta" : {
         "dependent-vtags" : [
           {"resource-id": "my-default-network-map",
            "tag": "3ee2cb7e8d63d9fab71b9b34cbf764436315542e"
           }
         ],
         "cost-type" : {"cost-mode" : "numerical",
                        "cost-metric" : "throughputrating"},
         "calendar-response-attributes" : [
           "calendar-start-time" : "Tue, 1 Jul 2014 13:00:00 GMT",
           "time-interval-size" : 7200,
           "number-of-intervals" : 12
         ]
       },
       "cost-map" : {
         "PID1": { "PID1": [v1,v2, ... v12],
                   "PID2": [v1,v2, ... v12],
                   "PID3": [v1,v2, ... v12] },
         "PID2": { "PID1": [v1,v2, ... v12],
                   "PID2": [v1,v2, ... v12],
                   "PID3": [v1,v2, ... v12] }
       }
     }






Randriamasy, et al.      Expires August 11, 2019               [Page 19]

Internet-Draft             ALTO Cost Calendar              February 2019


4.2.  Calendar extensions in the Endpoint Cost Service

   This document extends the Endpoint Cost Service, as defined in
   {11.5.1} of [RFC7285], by adding new input parameters and
   capabilities, and by returning JSONArrays instead of JSONNumbers as
   the cost values.  The media type {11.5.1.1} and HTTP method
   {11.5.1.2} are unchanged.

4.2.1.  Calendar specific input in Endpoint Cost requests

   The extensions to the requests for calendared Endpoint Cost Maps are
   the same as for the Filtered Cost Map Service, specified in section
   Section 4.1.1 of this draft.

   The ReqEndpointCostMap object for a calendared ECM request will have
   the following format:

   object {
     [CostType cost-type;]
     [CostType multi-cost-types<1..*>;]
     [JSONBoolean calendared<1..*>;]
     EndpointFilter endpoints;
   } ReqEndpointCostMap;

   object {
     [TypedEndpointAddr srcs<0..*>;]
     [TypedEndpointAddr dsts<0..*>;]
   } EndpointFilter;


4.2.2.  Calendar attributes in the Endpoint Cost response

   The "meta" field of a calendared Endpoint Cost response MUST include
   at least:

   o  if the ALTO Client supports cost values for one Cost Type at a
      time only: the "meta" fields specified in {11.5.1.6} of [RFC7285]
      for the Endpoint Cost response:

      *  "cost-type" field.

   o  if the ALTO Client supports cost values for several Cost Types at
      a time, as specified in [RFC8189] : the "meta" fields specified in
      [RFC8189] for the the Endpoint Cost response:

      *  "cost-type" field with value set to '{}', for backwards
         compatibility with [RFC7285].




Randriamasy, et al.      Expires August 11, 2019               [Page 20]

Internet-Draft             ALTO Cost Calendar              February 2019


      *  "multi-cost-types" field.

   If the client request does not provide member "calendared" or if it
   provides it with a value equal to 'false', for all the requested Cost
   Types, then the ALTO Server response is exactly as specified in
   [RFC7285] and [RFC8189].

   If the ALTO client provides member "calendared" in the input
   parameters with a value equal to 'true' for given requested Cost
   Types, the "meta" member of a calendared Endpoint Cost response MUST
   include, for these Cost Types, an additional member "calendar-
   response-attributes", the contents of which obey the same rules as
   for the Filtered Cost Map Service, specfied in Section 4.1.2.  The
   Server response is thus changed as follows, w.r.t [RFC7285] and
   [RFC8189]:

   o  the "meta" member has one additional field
      "CalendarResponseAttributes", as specified for the Filtered Cost
      Map Service,

   o  the calendared costs are JSONArrays instead of JSONNumbers for the
      legacy ALTO implementation.  All arrays have a number of values
      equal to 'number-of-intervals'.

   If the value of member "calendared" is equal to 'false' for a given
   requested Cost Type, the ALTO Server MUST return, for this Cost Type,
   a single cost value as specified in [RFC7285].

4.2.3.  Use case and example: ECS with a routingcost Calendar

   Let us assume an Application Client is located in an end system with
   limited resources and having an access to the network that is either
   intermittent or provides an acceptable quality in limited but
   predictable time periods.  Therefore, it needs to both schedule its
   resources greedy networking activities and its ALTO transactions.

   The Application Client has the choice to trade content or resources
   with a set of Endpoints and needs to decide with which one it will
   connect and at what time.  For instance, the Endpoints are spread in
   different time-zones, or have intermittent access.  In this example,
   the 'routingcost' is assumed to be time-varying, with values provided
   as ALTO Calendars.

   The ALTO Client associated with the Application Client queries an
   ALTO Calendar on 'routingcost' and will get the Calendar covering the
   24 hours time period "containing" the date and time of the ALTO
   client request.




Randriamasy, et al.      Expires August 11, 2019               [Page 21]

Internet-Draft             ALTO Cost Calendar              February 2019


   For Cost Type "num-routingcost", the solicited ALTO Server has
   defined 3 different daily patterns each represented by a Calendar, to
   cover the week of Monday June 30th at 00:00 to Sunday July 6th 23:59:

   - C1 for Monday, Tuesday, Wednesday, Thursday, (week days)

   - C2 for Saturday, Sunday, (week end)

   - C3 for Friday (maintenance outage on July 4, 2014 from 02:00:00 GMT
   to 04:00:00 GMT, or big holiday such as New Year evening).

   In the following example, the ALTO Client sends its request on
   Tuesday July 1st 2014 at 13:15.

   To calculate the Content-Length in the server response, the
   "routingcost" values are assumed to be encoded in 3 digits.



































Randriamasy, et al.      Expires August 11, 2019               [Page 22]

Internet-Draft             ALTO Cost Calendar              February 2019


  POST /calendar/endpointcost/lookup HTTP/1.1
  Host: alto.example.com
  Content-Length: 306
  Content-Type: application/alto-endpointcostparams+json
  Accept: application/alto-endpointcost+json,application/alto-error+json

  {
    "cost-type" : {"cost-mode" : "numerical",
                   "cost-metric" : "routingcost"},
    "calendared" : [true],
    "endpoints" : {
      "srcs": [ "ipv4:192.0.2.2" ],
      "dsts": [
        "ipv4:192.0.2.89",
        "ipv4:198.51.100.34",
        "ipv4:203.0.113.45",
        "ipv6:2001:db8::10"
      ]
    }
  }


  HTTP/1.1 200 OK
  Content-Length: 996
  Content-Type: application/alto-endpointcost+json

  {
    "meta" : {
      "cost-type" : {"cost-mode" : "numerical",
                     "cost-metric" : "routingcost"},
      "calendar-response-attributes" : [
        {"calendar-start-time" : "Mon, 30 Jun 2014 00:00:00 GMT",
         "time-interval-size" : 3600,
         "number-of-intervals" : 24,
         "repeated": 4
        }
      ],
    },
    "endpoint-cost-map" : {
      "ipv4:192.0.2.2": {
        "ipv4:192.0.2.89"    : [v1, v2, ... v24],
        "ipv4:198.51.100.34" : [v1, v2, ... v24],
        "ipv4:203.0.113.45"  : [v1, v2, ... v24],
        "ipv6:2001:db8::10" : [v1, v2, ... v24]
      }
    }
  }




Randriamasy, et al.      Expires August 11, 2019               [Page 23]

Internet-Draft             ALTO Cost Calendar              February 2019


   When the Client gets the Calendar for "routingcost", it sees that the
   "calendar-start-time" is Monday at 00h00 GMT and member "repeated" is
   equal to '4'.  It understands that the provided values are valid
   until Thursday included and will only need to get a Calendar update
   on Friday.

4.2.4.  Use case and example: ECS with a multi-cost calendar for
        routingcost and owdelay

   In this example, it is assumed that the ALTO Server implements multi-
   cost capabilities, as specified in [RFC8189] . That is, an ALTO
   client can request and receive values for several cost types in one
   single transaction.  An illustrating use case is a path selection
   done on the basis of 2 metrics: routing cost and owdelay.

   As in the previous example, the IRD indicates that the ALTO Server
   provides "routingcost" Calendars in terms of 24 time intervals of 1
   hour (3600 seconds) each.

   For metric "owdelay", the IRD indicates that the ALTO Server provides
   Calendars in terms of 12 time intervals values lasting each 5 minutes
   (300 seconds).

   In the following example transaction, the ALTO Client sends its
   request on Tuesday July 1st 2014 at 13:15.

   This example assumes that the values of metric "owdelay" are encoded
   in 3 digits.

  POST calendar/endpointcost/lookup HTTP/1.1
  Host: alto.example.com
  Content-Length: 391
  Content-Type: application/alto-endpointcostparams+json
  Accept: application/alto-endpointcost+json,application/alto-error+json

  {
    "cost-type" : {},
    "multi-cost-types" : [
      {"cost-mode" : "numerical", "cost-metric" : "routingcost"},
      {"cost-mode" : "numerical", "cost-metric" : "owdelay"}
    ],
    "calendared" : [true, true],
    "endpoints" : {
      "srcs": [ "ipv4:192.0.2.2" ],
      "dsts": [
        "ipv4:192.0.2.89",
        "ipv4:198.51.100.34",
        "ipv4:203.0.113.45",



Randriamasy, et al.      Expires August 11, 2019               [Page 24]

Internet-Draft             ALTO Cost Calendar              February 2019


        "ipv6:2001:db8::10"
      ]
    }
  }


  HTTP/1.1 200 OK
  Content-Length: 1588
  Content-Type: application/alto-endpointcost+json

  {
    "meta" : {
      "multi-cost-types" : [
        {"cost-mode" : "numerical", "cost-metric" : "routingcost"},
        {"cost-mode" : "numerical", "cost-metric" : "owdelay"}
      ],
      "calendar-response-attributes" : [
        {"cost-type-names" : "num-routingcost",
           "calendar-start-time" : "Mon, 30 Jun 2014 00:00:00 GMT",
           "time-interval-size" : 3600,
           "number-of-intervals" : 24,
           "repeated": 4 },
        {"cost-type-names" : "num-owdelay"
           "calendar-start-time" : "Tue, 1 Jul 2014 13:00:00 GMT",
           "time-interval-size" : 300,
           "number-of-intervals" : 12}
      ],
    },
    "endpoint-cost-map" : {
      "ipv4:192.0.2.2": {
        "ipv4:192.0.2.89"    : [[r1, r2, ... r24], [o1, o2, ... o12]],
        "ipv4:198.51.100.34" : [[r1, r2, ... r24], [o1, o2, ... o12]],
        "ipv4:203.0.113.45"  : [[r1, r2, ... r24], [o1, o2, ... o12]],
        "ipv6:2001:db8::10" : [[r1, r2, ... r24],
                                         [o1, o2, ... o12]]
      }
    }
  }


   When receiving the response, the client sees that the calendar values
   for 'routing cost' are repeated for 4 iterations.  Therefore, in its
   next requests until the routing cost calendar is expected to change,
   the client will only need to request a calendar for "owdelay".

   Without the ALTO Calendar extensions, the ALTO client would have no
   clue on the dynamicity of the metric value change and would spend
   needless time requesting values at an inappropriate pace.  In



Randriamasy, et al.      Expires August 11, 2019               [Page 25]

Internet-Draft             ALTO Cost Calendar              February 2019


   addition, without the Multi-Cost ALTO capabilities, the ALTO client
   would duplicate this waste of time as it would need to send one
   request per cost metric.

5.  IANA Considerations

   This document does not define any new media types or introduce any
   new IANA considerations.

6.  Security Considerations

   As an extension of the base ALTO protocol [RFC7285], this document
   fits into the architecture of the base protocol, and hence the
   Security Considerations (Section 15) of the base protocol fully apply
   when this extension is provided by an ALTO server.  For example, the
   same authenticity and integrity considerations (Section 15.1 of
   [RFC7285] still fully apply; the same considerations for the privacy
   of ALTO users (Section 15.4 of [RFC7285]) also still fully apply.

   The calendaring information provided by this extension requires
   additional considerations on three security considerations discussed
   in the base protocol: potential undesirable guidance to clients
   (Section 15.2 of [RFC7285]), confidentiality of ALTO information
   (Section 15.2 of [RFC7285]), and availability of ALTO (Section 15.5
   of [RFC7285]).  For example, by providing network information in the
   future in a calendar, this extension may improve availability of
   ALTO, when the ALTO server is unavailable but related information is
   already provided in the calendar.

   For confidentiality of ALTO information, an operator should be
   cognizant that this extension may introduce a new risk: an ALTO
   client may get information for future events that are scheduled
   through calendaring.  Possessing such information, the client may use
   it to achieve its goal: (1) initiating connections only at
   advantageous network costs, leading to unexpected network load; (2)
   generating massive connections to the network at times where its load
   is expected to be high.

   To mitigate this risk, the operator should address the risk of ALTO
   information being leaked to malicious clients or third parties.  As
   specified in Section 15.3.2 ("Protection Strategies") of [RFC7285],
   the ALTO server should authenticate ALTO clients and use the
   Transport Layer Security (TLS) protocol so that Man In The Middle
   (MITM) attacks to intercept an ALTO Calendar are not possible.
   [RFC7285] ensures the availability of such a solution in its
   Section 8.3.5.  "Authentication and Encryption", which specifies
   that: "ALTO server implementations as well as ALTO client




Randriamasy, et al.      Expires August 11, 2019               [Page 26]

Internet-Draft             ALTO Cost Calendar              February 2019


   implementations MUST support the "https" URI scheme of [RFC2818] and
   Transport Layer Security (TLS) of [RFC5246]".

   [RFC8446] specifies TLS 1.3 and writes in its section 1: "While TLS
   1.3 is not directly compatible with previous versions, all versions
   of TLS incorporate a versioning mechanism which allows clients and
   servers to interoperably negotiate a common version if one is
   supported by both peers".  So ALTO clients and servers MAY use newer
   versions (e.g., 1.3) of TLS as long as the negotiation process
   succeeds.  To ensure backward compatibility with [RFC7285], it is
   RECOMMENDED for both Calendar-aware Clients and Servers to both
   support at least TLS 1.2, until it gets deprecated.

   To avoid malicious or erroneous guidance from ALTO information, an
   ALTO client should be cognizant that using calendaring information
   can have risks: (1) Calendar values, especially in "repeated"
   Calendars may be only statistical, and (2) future events may change.
   Hence, a more robust ALTO client should adapt and extend protection
   strategies specified in Section 15.2 of the base protocol: it should
   develop self check and also ensure information update, to reduce the
   impact of this risk.  To address the risk of unexpected ALTO Values
   changes that the ALTO Client would be unaware of, it is RECOMMENDED
   that Servers supporting Calendars also support the "ALTO Incremental
   Updates Using Server-Sent Events (SSE)" Service, specified in
   [draft-ietf-alto-incr-update-sse].  Likewise, it is RECOMMENDED that
   Clients using Calendars also support the SSE Service.

7.  Operational Considerations

   Conveying ALTO Cost Calendars tends to reduce the on-the-wire data
   exchange volume compared to multiple single cost ALTO transactions,
   as an application has a set of time-dependent values upon which it
   can plan its connections in advance with no need for the ALTO Client
   to query information at each time.  Additionally, the Calendar
   response attribute "repeated", when provided, saves additional data
   exchanges in that it indicates that the ALTO Client does not need to
   query Calendars during a period indicated by this attribute.
   Unexpected changes during this period can be handled by using the SSE
   Service as discussed in Section 6, if the Server and the Client
   support it.

   High resolution intervals may be needed when values change, sometimes
   during very small time intervals but in a significant manner.  A way
   to avoid conveying too many entries is to leverage on the "repeated"
   feature.  A server can smartly set the calendar start time and number
   of intervals so as to declare them "repeated" for a large number of
   periods, until the Calendar values change and are conveyed to
   requesting Clients.



Randriamasy, et al.      Expires August 11, 2019               [Page 27]

Internet-Draft             ALTO Cost Calendar              February 2019


   Clients and Servers supporting ALTO Calendars use [RFC8259].
   [RFC7285] encodes its requests and responses using the JSON Data
   Interchange Format specified in [RFC7159].  The latter has been
   obsoleted by [RFC8259], that among others makes UTF-8 mandatory for
   text encoding to improve interoperability.  Therefore, Clients and
   Servers implementations using UTF-{16,32} need to be cognizant of the
   subsequent interoperability risks and it is RECOMMENDED for them to
   switch to UTF-8 encoding.

8.  Acknowledgements

   The authors would like to thank Fred Baker, Li Geng, Diego Lopez, He
   Peng and Haibin Song for fruitful discussions and feedback on earlier
   draft versions.  Dawn Chan, Kai Gao, Vijay Gurbani, Yichen Qian and
   Jensen Zhang provided substantial review feedback and suggestions to
   the protocol design.

9.  References

9.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC7285]  Alimi, R., Ed., Penno, R., Ed., Yang, Y., Ed., Kiesel, S.,
              Previdi, S., Roome, W., Shalunov, S., and R. Woundy,
              "Application-Layer Traffic Optimization (ALTO) Protocol",
              RFC 7285, DOI 10.17487/RFC7285, September 2014,
              <https://www.rfc-editor.org/info/rfc7285>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8189]  Randriamasy, S., Roome, W., and N. Schwan, "Multi-Cost
              Application-Layer Traffic Optimization (ALTO)", RFC 8189,
              DOI 10.17487/RFC8189, October 2017,
              <https://www.rfc-editor.org/info/rfc8189>.

9.2.  Informative References

   [draft-ietf-alto-incr-update-sse]
              W. Roome, Y. Yang, S. Chen, "ALTO Incremental Updates
              Using Server-Sent Events (SSE) (work in progress)",
              December 2018.




Randriamasy, et al.      Expires August 11, 2019               [Page 28]

Internet-Draft             ALTO Cost Calendar              February 2019


   [draft-ietf-alto-performance-metrics]
              Q. Wu, Y. Yang, Y. Lee, D. Dhody, S. Randriamasy, "ALTO
              Performance Cost Metrics (work in progress)", June 2018.

   [IEEE.754.2008]
              Institute of Electrical and Electronics Engineers,
              "Standard for Binary Floating-Point Arithmetic, IEEE
              Standard 754", August 2008.

   [RFC2818]  Rescorla, E., "HTTP Over TLS", RFC 2818,
              DOI 10.17487/RFC2818, May 2000,
              <https://www.rfc-editor.org/info/rfc2818>.

   [RFC5246]  Dierks, T. and E. Rescorla, "The Transport Layer Security
              (TLS) Protocol Version 1.2", RFC 5246,
              DOI 10.17487/RFC5246, August 2008,
              <https://www.rfc-editor.org/info/rfc5246>.

   [RFC5693]  Seedorf, J. and E. Burger, "Application-Layer Traffic
              Optimization (ALTO) Problem Statement", RFC 5693,
              DOI 10.17487/RFC5693, October 2009,
              <https://www.rfc-editor.org/info/rfc5693>.

   [RFC7159]  Bray, T., Ed., "The JavaScript Object Notation (JSON) Data
              Interchange Format", RFC 7159, DOI 10.17487/RFC7159, March
              2014, <https://www.rfc-editor.org/info/rfc7159>.

   [RFC7231]  Fielding, R., Ed. and J. Reschke, Ed., "Hypertext Transfer
              Protocol (HTTP/1.1): Semantics and Content", RFC 7231,
              DOI 10.17487/RFC7231, June 2014,
              <https://www.rfc-editor.org/info/rfc7231>.

   [RFC8259]  Bray, T., Ed., "The JavaScript Object Notation (JSON) Data
              Interchange Format", STD 90, RFC 8259,
              DOI 10.17487/RFC8259, December 2017,
              <https://www.rfc-editor.org/info/rfc8259>.

   [RFC8446]  Rescorla, E., "The Transport Layer Security (TLS) Protocol
              Version 1.3", RFC 8446, DOI 10.17487/RFC8446, August 2018,
              <https://www.rfc-editor.org/info/rfc8446>.

Authors' Addresses









Randriamasy, et al.      Expires August 11, 2019               [Page 29]

Internet-Draft             ALTO Cost Calendar              February 2019


   Sabine Randriamasy
   Nokia Bell Labs
   Route de Villejust
   NOZAY  91460
   FRANCE

   Email: Sabine.Randriamasy@nokia-bell-labs.com


   Richard Yang
   Yale University
   51 Prospect st
   New Haven, CT  06520
   USA

   Email: yry@cs.yale.edu


   Qin Wu
   Huawei
   101 Software Avenue, Yuhua District
   Nanjing, Jiangsu  210012
   China

   Email: sunseawq@huawei.com


   Lingli Deng
   China Mobile
   China

   Email: denglingli@chinamobile.com


   Nico Schwan
   Thales Deutschland
   Lorenzstrasse 10
   Stuttgart  70435
   Germany

   Email: nico.schwan@thalesgroup.com










Randriamasy, et al.      Expires August 11, 2019               [Page 30]
